# Jupyter Notebook
## Cell
### Command mode(파랑)
- 셀 자체에 명령, 삭제, 복사, 이동, 생성...
- 셀 바깥쪽 클릭 or ESC
- a(bove) : 현재 셀 위에 셀 추가
- b(elow) : 현재 셀 아래에 셀 추가
- x       : 현재 셀 자르기, 삭제 대용으로 사용
- h       : 단축키 사용법
    
### Edit mode
- 셀 안에다 무언가 입력
- 안쪽 클릭 or Enter
- 파이썬 코드 입력
- shift + endter : 현재 셀 실행
    - 코드를 적절히 끊어줘야 함
- 문서작성

# 파이썬 기본 문법 리뷰
- 파이썬 데이터 // 데이터를 어떻게 다룰 것인가

## 1. 파이썬 데이터
### 1.1 파이썬 기본 데이터 타입들
#### 1.1.1 숫자 데이터(정수, 실수)
- 계산기 사용하듯 사용

#### 1.1.2 문자열
- 생성 : '', "" 안에 들어가면 무조건 문자열
- 연산 : 더하기 => 하나로 합쳐징
    - 숫자와 문자는 연산이 안됨 => 예외) 정수 곱하기 : 정수만큼 반복함
- 문자열 기능들
    - split, replace, ...
    
#### 1.1.3 bool
- True, False
- 연산할 때 정수 1, 0

#### 1.1.4 None
- 데이터가 없음을 명시적 표현함

In [12]:
'python'.split('t')

['py', 'hon']

### 1.2 변수
- 데이터를 재사용하기 위해서 데이터에 이름을 붙여 줌.
- = : 할당 연산자, 오른쪽의 데이터를 왼쪽 변수에 할당해 줌
- 데이터를 새로 생성했으면 무조건 변수부터 만들어 주자!

### 1.3 데이터의 기능과 속성값
- 파이썬의 모든 데이터들은 데이터 타입마다 각자 고유한 기능이나 속성값이 있음
- .(dot) 연산자 : 앞에 있는 데이터에서 기능이나 속성값을 꺼내줌
- 원리만 기억하고 구체적인 기능들은 그때그때 검색해서 씀

In [10]:
test = 3

### 1.4 자료구조
- 여러개의 데이터를 효율적으로 묶어서 관리
- 파이썬 기본 자료구조
- 리스트, 딕셔너리, (튜플, 셋)

#### 1.4.1 리스트
- 순서
- 생성 : []
- 데이터 꺼내기 => 순서
- 슬라이싱 => 범위를 이용해서 가져오기
- append => 데이터 추가, 원본 데이터를 바꿈

In [14]:
fruits = ['apple', 'banana', 'mango', 'tomato']

In [17]:
fruits[-1]

'tomato'

In [19]:
fruits[1:3]

['banana', 'mango']

In [20]:
fruits[:3]

['apple', 'banana', 'mango']

In [21]:
fruits.append('melon')

In [22]:
fruits

['apple', 'banana', 'mango', 'tomato', 'melon']

In [ ]:
test = []

test.append( 데이터 )
test.append( 데이터 )

#### 1.4.2 딕셔너리
- 순서 x, 데이터마다 키값이 있음
- 생성 : { }
- 데이터 꺼내기
    - 파이썬의 모든 자료구조는 데이터를 꺼낼 때 [ ]
- 데이터 추가하기
    - dict[키] = 데이터

In [24]:
#math, eng, kor

grade = {'math':100, 'eng':92, 'kor':88}

In [25]:
grade['math']

100

In [26]:
grade.keys()

dict_keys(['math', 'eng', 'kor'])

In [28]:
grade['music'] = 90

In [29]:
grade

{'math': 100, 'eng': 92, 'kor': 88, 'music': 90}

In [ ]:
test = {}

test[키] = 데이터
test[키] = 데이터

#### 1.4.3 셋(set)
- 수학의 집합, 순서x, 중복x
- 집합 연산이 가능 => 교집합, 합집합, 차집합

In [30]:
set([1,2,3,4,1,1,1])

{1, 2, 3, 4}

In [31]:
a_category = [1,2,1,2,3]
b_category = [2,3,4,5,6]

In [34]:
set(a_category) - set(b_category)

{1}

In [35]:
set(b_category) - set(a_category)

{4, 5, 6}

In [36]:
set(a_category) | set(b_category)

{1, 2, 3, 4, 5, 6}

In [37]:
set(a_category) & set(b_category)

{2, 3}

## 2. 데이터를 어떻게 다룰 것인가
- 연산
- 함수
- 제어문

### 2.1 함수
- 동작, 기능
- ( ) => 동작버튼
- ( ) => 인풋들의 입구
    - 함수를 제대로 사용하려면 인풋을 요구사항에 맞게 제대로 넣어야 함
    - 데이터의 갯수와 순서와 타입을 맞춰야 함
    - 함수 shift + tab => 함수 사용법 확인 가능
- 리턴값(결과값)
    - 새로운 데이터가 생성되는지 아닌지
    - 생성되면 어떤 타입의 데이터인지
    - 변수에 할당 가능한지 확인하면 됨

In [41]:
print(1, 2) #새로운 데이터를 생성한 것이 아닌 화면에 출력만 해준것

1 2

In [42]:
sum( [1, 2, 3])

6

### 2.2 반복문
- DRY : Do not Repeat Yourself <=> DIY : Doing Yourself

### 2.3 For문
- 순서있는 자료구조에서 데이터를 순차적으로 꺼내는 느낌

In [ ]:
#for문 문법

for (임시)변수 in 순서있는 자료구조(리스트):
    반복하고 싶은 코드

In [43]:
for num in [1,2,3,4,5]:
    print(num)

1
2
3
4
5

In [49]:
# for문 연습 1 - 리스트 안의 숫자들을 다 더해보세요

num_list = [10, 11, 12, 13, 7, 8, 9]

result = 0
for num in num_list:
    result += num
    
result / len(num_list)

10.0

In [51]:
# for문 연습 2 - 리스트 안의 숫자들을 다 곱해보세요

num_list = [10, 11, 12, 13, 7, 8, 9]

result = 1
for num in num_list:
    result *= num
    
result

8648640

In [56]:
# for문 연습 3 - 리스트 안의 숫자들을 다 두배씩 해보세요

num_list = [10, 11, 12, 13, 7, 8, 9]

result = []
for num in num_list:
    result.append(num*2)

result

[20, 22, 24, 26, 14, 16, 18]

In [57]:
# range( 시작, 끝 ) => [시작, ..., 끝-1] 정수로 이루어진 리스트가 만들어 짐(실제 리스트가 만들어지는 것은 아님)

for num in range(1, 11):
    print(num)

1
2
3
4
5
6
7
8
9
10

### 2.4 조건문
- 조건에 따라 실행되는 코드를 다르게 하려고

In [ ]:
# 조건문 문법

if 조건:
    조건이 참일 때 실행되는 코드
elif 조건2:
    조건2가 참일 때 실행되는 코드
...    
else:
    위에 있는 조건 빼고 다(여집합)

In [59]:
# 조건문에 조건 대신 데이터도 옴 => 파이썬의 모든 데이터들은 조건문에서 자동으로 True, False로 분류됨
# True   => 데이터가 무언가 채워져 있을 때
# False  => 데이터가 무언가 비워져 있을 때

data = ''

if data:
    print("true")
else:
    print("false")

false

In [61]:
# 문자열의 기능들
# 1. split
# 특정문자를 기준으로 원래 문자를 잘라줌
# 결과는 문자열 리스트 생성

test = 'python'
test.split('t')

['py', 'hon']

In [62]:
# split 연습문제

test_list = ['result.xlsx', 'data.pdf', 'data2.xlsx', 'result.doc']

result = []
for test in test_list:
    result.append(test.split('.')[0])

result

['result', 'data', 'data2', 'result']

In [64]:
# 2. replace
# 문자열 안의 특정 문자를 찾아서 다른 문자로 바꿔줌
# 결과로 문자열이 생성됨 => 연속으로 사용 가능

test = 'python'
test.replace('p', 'c').replace('n', 'm')

'cythom'

In [70]:
# replace 연습문제

price_list = ['3,000won', '2,800won', '500won', '3,200won']

result = 0
for price in price_list:
    result += int( price.replace(',', '').replace('won', '') )
    
result / len(price_list)

2375.0

In [78]:
# 3. format

for num in range(1,6):
    print('data {}'.format(num) )

data 1
data 2
data 3
data 4
data 5

In [80]:
for i in range(2,10):
    for j in range(1,10):
        print('{} * {} = {}'.format(i, j, i*j))
    print()

2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

4 * 1 = 4
4 * 2 = 8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36

5 * 1 = 5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

6 * 1 = 6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

7 * 1 = 7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63

8 * 1 = 8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72

9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81

## 3. 함수와 모듈
### 3.1 함수
- 코드를 재사용하기 위해서 코드에 이름을 붙여줌

In [86]:
# 왜 함수를 만들어야 하나?
# 1. 변수 중복
# 2. 변수명 통일이 안됨

pi = 3.14
result = pi * 1.14
some_list = [result, 0.11, 3.01, 2.01, 5]

result = 0
for num in num_list:
    result += num
    
result / len(num_list)

In [ ]:
# 함수 정의

def 함수이름( 값을 확정하지 않은 변수들(매개변수) ):
    재사용하고 싶은 코드
    return 가져오고 싶은 값들   # 값이 리턴되는 것이지 변수가 리턴되는 것은 아님

In [91]:
def get_avg(num_list):
    result = 0
    for num in num_list:
        result += num

    avg = result / len(num_list)
    return avg

In [95]:
get_avg([2, 3, 4, 5])

3.5

In [101]:
# 직각 삼각형 빗변의 길이

import math

def get_side(bottom, height):
    side = math.sqrt(bottom**2 + height**2)
    return side

In [109]:
get_side(1,1)

1.4142135623730951

In [112]:
import my_lib

In [113]:
my_lib.get_side(1,2)

2.23606797749979

# Pandas
- 새로운 자료구조 2개를 제공
- Series, DataFrame

In [114]:
import pandas as pd

In [115]:
# A, B, C, D, E

math = [90, 92, 89, 90, 91]
eng = [89, 90, 93, 91, 88]
kor = [92, 91, 92, 90, 92]

## 1. Series
- 1차원 자료구조
- 구성요서 2개 : index, values
- 순서있음

In [135]:
math_sr = pd.Series( math, index=['A', 'B', 'C', 'D', 'E'] )
eng_sr = pd.Series( eng, index=['A', 'B', 'C', 'D', 'E'] )

In [125]:
# 데이터 꺼내기
# 인덱스, 순서 모두 가능

print(math_sr['A'])
print(math_sr[0])

90
90

In [127]:
# 슬라이싱

math_sr['A':'D']

A    90
B    92
C    89
D    90
dtype: int64

In [130]:
# 기능들 => 매우 많음
# 정렬

math_sr.sort_values( ascending=False )  # 인덱스와 같이 움직임

B    92
E    91
A    90
D    90
C    89
dtype: int64

In [133]:
# 간단한 통계값들

math_sr.describe()

count     5.000000
mean     90.400000
std       1.140175
min      89.000000
25%      90.000000
50%      90.000000
75%      91.000000
max      92.000000
dtype: float64

In [134]:
# 필터링
# 데이터를 가져오는데 조건을 이용해서 가져옴

math_sr[ math_sr > 90 ]

B    92
E    91
dtype: int64

In [140]:
#시리즈의 연산
# 값을 기준으로 연산함 - 같은 인덱스끼리 연산

math_sr / eng_sr

A    1.011236
B    1.022222
C    0.956989
D    0.989011
E    1.034091
dtype: float64

In [144]:
# 시리즈의 연산2
# 시리즈와 값 하나 연산 => 시리즈에 모든 데이터에게 똑같이 연산해 줌

math_sr > 90

A    False
B     True
C    False
D    False
E     True
dtype: bool

In [147]:
(math_sr + eng_sr) / 2

A    89.5
B    91.0
C    91.0
D    90.5
E    89.5
dtype: float64

## 2. DataFrame
- 2차원 자료구조
- 구성요소 3개 : column, index, values
- 순서있음 => 기본적으로 행방향

In [158]:
# A, B, C, D, E

math = [90, 92, 89, 90, 91]
eng = [89, 90, 93, 91, 88]
kor = [92, 91, 92, 90, 92]

temp = {'math':math, 'eng':eng, 'kor':kor}
grade_df = pd.DataFrame( temp, index=['A', 'B', 'C', 'D', 'E'] )

In [160]:
# 데이터 꺼내기
# 기본적으로 컬럼으로 접근

grade_df['math']

A    90
B    92
C    89
D    90
E    91
Name: math, dtype: int64

In [161]:
# 인덱스(행)을 기준으로 가져오고 싶을 때
# .loc

grade_df.loc['A']

math    90
eng     89
kor     92
Name: A, dtype: int64

In [164]:
# 한 포인트로 접근하기
# .loc[인덱스, 컬럼]
# 어떤 데이터를 바꿀 때도 포인트로 접근

grade_df.loc['A', 'math']

90

In [ ]:
# 데이터프레임에서 컬럼에 접근하고 인덱스에 접근하기 때문에 값 변경x

grade_df['math']['A']

In [170]:
#기능들 
# 정렬

grade_df.sort_values(['math', 'eng'], ascending=False)

   math  eng  kor
B    92   90   91
E    91   88   92
D    90   91   90
A    90   89   92
C    89   93   92

In [171]:
# 간단한 통계값

grade_df.describe()

            math        eng        kor
count   5.000000   5.000000   5.000000
mean   90.400000  90.200000  91.400000
std     1.140175   1.923538   0.894427
min    89.000000  88.000000  90.000000
25%    90.000000  89.000000  91.000000
50%    90.000000  90.000000  92.000000
75%    91.000000  91.000000  92.000000
max    92.000000  93.000000  92.000000

In [174]:
# 필터링
# 데이터를 조건을 이용해서 가져오기

# 1. 조건을 줄때는 어떤 값(컬럼)을 기준으로 조건을 주는 것인지 명확히 써주자!
grade_df[ grade_df['math'] > 90 ]

   math  eng  kor
B    92   90   91
E    91   88   92

In [182]:
# 2. 조건을 여러개 넣을 때 연산 순서에 조심하자!
# 괄호로 묶어주기

grade_df[ (grade_df['math'] > 90) | (grade_df['kor'] > 90)]

   math  eng  kor
A    90   89   92
B    92   90   91
C    89   93   92
E    91   88   92

In [177]:
# 3. 조건이 3개 이상이 되면 먼저 연산을 해서 변수에 할당한 후 필터링하자

cond1 = grade_df['math'] > 90
cond2 = grade_df['kor'] > 90
cond3 = grade_df['eng'] > 90

grade_df[ cond1 & cond2 & cond3 ]

Empty DataFrame
Columns: [math, eng, kor]
Index: []

In [191]:
# DF의 연산 => 시리즈의 연산
# 새로운 속성을 생성
    
grade_df['total'] = grade_df['math'] + grade_df['eng'] + grade_df['kor']

In [192]:
grade_df['avg'] = grade_df['total'] / 3

In [193]:
grade_df

   math  eng  kor  total        avg
A    90   89   92    271  90.333333
B    92   90   91    273  91.000000
C    89   93   92    274  91.333333
D    90   91   90    271  90.333333
E    91   88   92    271  90.333333

In [194]:
grade_df[ : 2]

   math  eng  kor  total        avg
A    90   89   92    271  90.333333
B    92   90   91    273  91.000000

#  3. DF 연습

In [195]:
import seaborn as sns

In [197]:
titanic_df = sns.load_dataset( 'titanic' )

In [198]:
titanic_df.shape

(891, 15)

In [199]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [202]:
titanic_df.head(2) # titanic_df[:2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [204]:
titanic_df.tail()  # titanic_df[-5:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [208]:
live = 0
dead = 0

for val in titanic_df['survived']:
    if val:
        live += 1
    else:
        dead += 1

In [209]:
live, dead

(342, 549)

In [212]:
titanic_df['survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: survived, dtype: float64

In [217]:
# pclass와 생존률 간의 관계

titanic_df['pclass'].unique()

In [227]:
def show_cate_survived(df, column):
    for cate in df[column].unique():
        temp = df[ titanic_df[column] == cate ]
        print(cate)
        print(temp['survived'].value_counts(normalize=True))

In [230]:
show_cate_survived(titanic_df, 'sex')

male
0    0.811092
1    0.188908
Name: survived, dtype: float64
female
1    0.742038
0    0.257962
Name: survived, dtype: float64

In [232]:
# 필터링 연습
# 남자이고 20살 이하 요금을 100달러 이상 낸 데이터만 가져오기

cond1 = titanic_df['sex'] == 'male'
cond2 = titanic_df['age'] <= 20
cond3 = titanic_df['fare'] >= 100

titanic_df[ cond1 & cond2 & cond3 ]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
27,0,1,male,19.00,3,2,263.0000,S,First,man,True,C,Southampton,no,False
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
505,0,1,male,18.00,1,0,108.9000,C,First,man,True,C,Cherbourg,no,False
550,1,1,male,17.00,0,2,110.8833,C,First,man,True,C,Cherbourg,yes,False
802,1,1,male,11.00,1,2,120.0000,S,First,child,False,B,Southampton,yes,False

# 엑셀 데이터를 DF으로 정리하는 연습
통계청, 공공데이터 포탈, 서울시 데이터 광장
1. 컬럼
    - 사용할 컬럼(사용 안할 컬럼 삭제)
    - 컬럼명을 사용하기 좋게 바꾸기
2. 인덱스
    - 보통의 경우 0, 1, 2, ... 
    - 시계열 데이터(시간에 따라 값이 변해서 저장하는)경우 인덱스 datetime 날짜형식 데이터로 세팅
3. 데이터 값
    - 결측 데이터
    - 데이터 타입

## 1. read_excel
- 엑셀에서 특정 시트의 데이터를 DF로 가져옴
- header, index_col, usecols, skiprows, na_values

In [238]:
path = r'C:\Users\cypark\Desktop\Python을 활용한 빅데이터 분석 실무 실습자료\졸업생의 진로 현황(전체).xlsx'

raw_df = pd.read_excel( path, sheet_name=0 )

## 2. 컬럼파트
- 사용할 컬럼 추리고
- 컬럼명 바꾸기

In [242]:
raw_df.columns
# 각 데이터를 유니크하게 구별할 수 있는 컬럼 무조건 챙기기 ex. '정보공시 \n 학교코드'

use_cols = ['지역', '정보공시 \n 학교코드', '학교명', '졸업자.2', 
            '(특수목적고)과학고 진학자.2', '(특수목적고)외고ㆍ국제고 진학자.2']

In [243]:
# 여러개의 컬럼을 선택할 때 => 리스트로

raw_df[ use_cols ]

,지역,정보공시 \n 학교코드,학교명,졸업자.2,(특수목적고)과학고 진학자.2,(특수목적고)외고ㆍ국제고 진학자.2
0,지역,정보공시 \n 학교코드,학교명,합계,합계,합계
1,서울특별시 성북구,S000003514,서울대학교사범대학부설중학교,234,4,5
2,서울특별시 종로구,S000003562,서울대학교사범대학부설여자중학교,172,0,8
3,서울특별시 강남구,S010000698,개원중학교,214,2,9
4,서울특별시 서초구,S010000700,경원중학교,310,5,4
...,...,...,...,...,...,...
3454,제주특별자치도 제주시,S170000844,탐라중학교,298,1,1
3455,제주특별자치도 제주시,S170000512,제주영지학교,12,0,0
3456,제주특별자치도 제주시,S170000513,제주영송학교,21,0,0
3457,제주특별자치도 서귀포시,S170000790,서귀포온성학교,9,0,0
3458,제주특별자치도 제주시,S170000870,제주제일중학교부설방송통신중학교,NaN,NaN,NaN